tsung/load_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="indexing.kqsu4hptxs.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
<!--    <arrivalphase phase="6" duration="30" unit="second">
     <users arrivalrate="32" unit="second"></users>
   </arrivalphase> -->

   <!--
   <arrivalphase phase="7" duration="30" unit="second">
     <users arrivalrate="64" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="8" duration="30" unit="second">
     <users arrivalrate="128" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="9" duration="30" unit="second">
     <users arrivalrate="256" unit="second"></users>
   </arrivalphase>
    -->

  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <!-- flow 1: bidding users-->
    <session name="flow_1" probability="20" type="ts_http">

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>
      
      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="201" end="1000">
        <var name="nth_browsing_user" />
      </setdynvars>

      <request subst="true" >
        <http url='/users/sign_in' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=%%_nth_browsing_user%%@ucsb&amp;user[password]=123456" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <!-- bid a random item -->
      <request>
        <dyn_variable name='all_item' xpath="/html/body/div/div[2]/div[*]/div/a/@href"/>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(all_item,DynVars),
                        random:seed(now()),
                        lists:nth(random:uniform(length(Val)), Val) end.' >
                  <var name="rnd_item_index_page_url" />
      </setdynvars>

      <request subst="true">
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='%%_rnd_item_index_page_url%%' version='1.1' method='GET'></http>
      </request>

      <if var="authenticity_token" neq="">
        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="10" end="20000">
          <var name="rnd_bid_price" />
        </setdynvars>

        <thinktime value="1" random="true"></thinktime>

        <request subst="true" >
          <http url='%%_rnd_item_index_page_url%%/bid_records' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;bid_record[price]=%%_rnd_bid_price%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
        </request>
      </if>

      <!-- bid another item -->
      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(all_item,DynVars),
                        random:seed(now()),
                        lists:nth(random:uniform(length(Val)), Val) end.' >
                  <var name="rnd_item_index_page_url" />
      </setdynvars>

      <request subst="true">
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='%%_rnd_item_index_page_url%%' version='1.1' method='GET'></http>
      </request>

      <if var="authenticity_token" neq="">
        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="10" end="20000">
          <var name="bid_price" />
        </setdynvars>

        <thinktime value="1" random="true"></thinktime>

        <request subst="true" >
          <http url='%%_rnd_item_index_page_url%%/bid_records' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;bid_record[price]=%%_bid_price%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
        </request>
      </if>

      <!-- go to profile -->
      <request>
        <http url='/users/profile' version='1.1' method='GET'></http>
      </request>
      
      <!-- search something and link to it-->
      <request subst="true">
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/searches/new' version='1.1' method='GET'></http>
      </request>

      <if var="authenticity_token" neq="">
        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="1" end="10">
          <var name="random_community" />
        </setdynvars>

        <thinktime value="1" random="true"></thinktime>

        <request subst="true" >
          <dyn_variable name="search_item" re="[Ll]ocation: http://.*/searches/(.*)\r" />
          <http url='/searches' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;search[category_id]=%%_random_community%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
        </request>

        <request subst="true" >
          <dyn_variable name="all_search_item_url" xpath="/html/body/div[2]/div/div/div/table/tbody/tr[*]/td[1]/a/@href"/>
          <http url='/searches/%%_search_item%%' version='1.1' method='GET'></http>
        </request>

        <if var="all_search_item_url" neq="">
          <thinktime value="1" random="true"></thinktime>

          <setdynvars sourcetype="eval"
                    code='fun({Pid,DynVars})->
                          {ok,Val}=ts_dynvars:lookup(all_search_item_url,DynVars),
                          random:seed(now()),
                          lists:nth(random:uniform(length(Val)), Val) end.' >
                    <var name="rnd_search_item_url" />
          </setdynvars>

          <request subst="true">
            <http url='%%_rnd_search_item_url%%' version='1.1' method='GET'></http>
          </request>
        </if>

      </if>

      <!-- another search but bid it-->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request subst="true">
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/searches/new' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <if var="authenticity_token" neq="">
        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="0" end="2000">
          <var name="rnd_min_price" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="5000" end="50000">
          <var name="rnd_max_price" />
        </setdynvars>

        <thinktime value="1" random="true"></thinktime>

        <request subst="true" >
          <dyn_variable name="search_item" re="[Ll]ocation: http://.*/searches/(.*)\r" />
          <http url='/searches' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;search[min_price]=%%_rnd_min_price%%&amp;search[max_price]=%%_rnd_max_price%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
        </request>

        <request subst="true" >
          <dyn_variable name="all_search_item_url" xpath="/html/body/div[2]/div/div/div/table/tbody/tr[*]/td[1]/a/@href"/>
          <http url='/searches/%%_search_item%%' version='1.1' method='GET'></http>
        </request>

        <thinktime value="1" random="true"></thinktime>
        <if var="all_search_item_url" neq="">
          <setdynvars sourcetype="eval"
                    code='fun({Pid,DynVars})->
                          {ok,Val}=ts_dynvars:lookup(all_search_item_url,DynVars),
                          random:seed(now()),
                          lists:nth(random:uniform(length(Val)), Val) end.' >
                    <var name="rnd_search_item_url" />
          </setdynvars>

          <request subst="true">
            <dyn_variable name='authenticity_token'></dyn_variable>
            <http url='%%_rnd_search_item_url%%' version='1.1' method='GET'></http>
          </request>

          <if var="authenticity_token" neq="">
            <setdynvars sourcetype="eval"
                      code='fun({Pid,DynVars})->
                            {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                            re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                      <var name="authenticity_token" />
            </setdynvars>

            <thinktime value="1" random="true"></thinktime>

            <setdynvars sourcetype="random_number" start="200" end="20000">
              <var name="rnd_bid_price" />
            </setdynvars>

            <request subst="true" >
              <http url='%%_rnd_search_item_url%%/bid_records' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;bid_record[price]=%%_rnd_bid_price%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
            </request>
          </if>
        </if>
      </if>

    </session>

    <!-- ############################################################ -->
    <!-- flow 2, browsing user -->
    <session name="flow_2" probability="41" type="ts_http">

      <request>
      <http url='/' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <!-- go to a random item -->
      <request>
        <dyn_variable name='all_item' xpath="/html/body/div/div[2]/div[*]/div/a/@href"/>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                    code='fun({Pid,DynVars})->
                          {ok,Val}=ts_dynvars:lookup(all_item,DynVars),
                          random:seed(now()),
                          lists:nth(random:uniform(length(Val)), Val) end.' >
                    <var name="rnd_item_index_page_url" />
      </setdynvars>

      <request subst="true">
        <http url='%%_rnd_item_index_page_url%%' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <!-- go to next random item -->
      <request>
        <dyn_variable name='all_item' xpath="/html/body/div/div[2]/div[*]/div/a/@href"/>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                    code='fun({Pid,DynVars})->
                          {ok,Val}=ts_dynvars:lookup(all_item,DynVars),
                          random:seed(now()),
                          lists:nth(random:uniform(length(Val)), Val) end.' >
                    <var name="rnd_item_index_page_url" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true">
        <http url='%%_rnd_item_index_page_url%%' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <!-- go to third random item -->
      <request>
        <dyn_variable name='all_item' xpath="/html/body/div/div[2]/div[*]/div/a/@href"/>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                    code='fun({Pid,DynVars})->
                          {ok,Val}=ts_dynvars:lookup(all_item,DynVars),
                          random:seed(now()),
                          lists:nth(random:uniform(length(Val)), Val) end.' >
                    <var name="rnd_item_index_page_url" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true">
        <http url='%%_rnd_item_index_page_url%%' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <!-- go to community -->
      <request>
        <http url='/communities' version='1.1' method='GET'></http>
      </request>
      
      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="random_community" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true" >
        <http url='/communities/%%_random_community%%' version='1.1' method='GET'></http>
      </request>

      <!-- go to another community -->
      <request>
        <http url='/communities' version='1.1' method='GET'></http>
      </request>
      
      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="random_community" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true" >
        <http url='/communities/%%_random_community%%' version='1.1' method='GET'></http>
      </request>

    </session>

    <!-- ############################################################ -->
    <!-- flow 3, search user -->
    <session name="flow_3" probability="35" type="ts_http">

      <request>
      <http url='/' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <!-- go to a random item -->
      <request>
        <dyn_variable name='all_item' xpath="/html/body/div/div[2]/div[*]/div/a/@href"/>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                    code='fun({Pid,DynVars})->
                          {ok,Val}=ts_dynvars:lookup(all_item,DynVars),
                          random:seed(now()),
                          lists:nth(random:uniform(length(Val)), Val) end.' >
                    <var name="rnd_item_index_page_url" />
      </setdynvars>

      <request subst="true">
        <http url='%%_rnd_item_index_page_url%%' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <!-- search by name -->
      <request subst="true">
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/searches/new' version='1.1' method='GET'></http>
      </request>

      <if var="authenticity_token" neq="">
        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_string" length="2">
          <var name="rnd_name" />
        </setdynvars>

        <request subst="true" >
          <dyn_variable name="search_item" re="[Ll]ocation: http://.*/searches/(.*)\r" />
          <http url='/searches' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;search[keywords]=%%_rnd_name%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
        </request>

        <request subst="true" >
          <http url='/searches/%%_search_item%%' version='1.1' method='GET'></http>
        </request>
      </if>

      <!-- search by communities -->
      <request subst="true">
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/searches/new' version='1.1' method='GET'></http>
      </request>

      <if var="authenticity_token" neq="">
        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="1" end="10">
          <var name="random_community" />
        </setdynvars>

        <thinktime value="1" random="true"></thinktime>

        <request subst="true" >
          <dyn_variable name="search_item" re="[Ll]ocation: http://.*/searches/(.*)\r" />
          <http url='/searches' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;search[category_id]=%%_random_community%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
        </request>

        <request subst="true" >
          <http url='/searches/%%_search_item%%' version='1.1' method='GET'></http>
        </request>
      </if>

    </session>

    <!-- ############################################################ -->
    <!-- flow 4, big seller -->
    <session name="flow_4" probability="1" type="ts_http">

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="151" end="200">
        <var name="rnd_big_seller" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true" >
        <http url='/users/sign_in' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=%%_rnd_big_seller%%@ucsb&amp;user[password]=123456" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <!-- go to profile and link one item-->
      <request>
        <dyn_variable name='all_profile_selling_item_url' xpath="/html/body/div/div/div/div[1]/table/tbody/tr[*]/td[1]/a/@href"/>
        <http url='/users/profile' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                code='fun({Pid,DynVars})->
                      {ok,Val}=ts_dynvars:lookup(all_profile_selling_item_url,DynVars),
                      random:seed(now()),
                      lists:nth(random:uniform(length(Val)), Val) end.' >
                <var name="rnd_profile_selling_item_url" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true">
        <http url='%%_rnd_profile_selling_item_url%%' version='1.1' method='GET'></http>
      </request>

      <!-- link next one -->
      <request>
        <dyn_variable name='all_profile_selling_item_url' xpath="/html/body/div/div/div/div[1]/table/tbody/tr[*]/td[1]/a/@href"/>
        <http url='/users/profile' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                code='fun({Pid,DynVars})->
                      {ok,Val}=ts_dynvars:lookup(all_profile_selling_item_url,DynVars),
                      random:seed(now()),
                      lists:nth(random:uniform(length(Val)), Val) end.' >
                <var name="rnd_profile_selling_item_url" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>
      
      <request subst="true">
        <http url='%%_rnd_profile_selling_item_url%%' version='1.1' method='GET'></http>
      </request>

      <!-- link third one -->
      <request>
        <dyn_variable name='all_profile_selling_item_url' xpath="/html/body/div/div/div/div[1]/table/tbody/tr[*]/td[1]/a/@href"/>
        <http url='/users/profile' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                code='fun({Pid,DynVars})->
                      {ok,Val}=ts_dynvars:lookup(all_profile_selling_item_url,DynVars),
                      random:seed(now()),
                      lists:nth(random:uniform(length(Val)), Val) end.' >
                <var name="rnd_profile_selling_item_url" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>
      
      <request subst="true">
        <http url='%%_rnd_profile_selling_item_url%%' version='1.1' method='GET'></http>
      </request>

    </session>

    <!-- ############################################################ -->
    <!-- flow 5, small seller -->
    <session name="flow_5" probability="2" type="ts_http">

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="150">
        <var name="rnd_small_seller" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true" >
        <http url='/users/sign_in' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=%%_rnd_small_seller%%@ucsb&amp;user[password]=123456" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <!-- post first item -->
      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/bid_items/new' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <setdynvars sourcetype="random_string" length="20">
        <var name="rnd_name" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="10" end="500">
        <var name="rnd_starting_price" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="5000" end="50000">
        <var name="rnd_fixed_price" />
      </setdynvars>

      <request subst="true" >
        <dyn_variable name="item_id_1" re="[Ll]ocation: http://.*/bid_items/(.*)\r" />
        <http url="/bid_items" version="1.1" contents="authenticity_token=%%_authenticity_token%%&amp;bid_item[item_name]=%%_rnd_name%%&amp;bid_item[starting_price]=%%_rnd_starting_price%%&amp;bid_item[fixed_price]=%%_rnd_fixed_price%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <!-- post second item -->
      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/bid_items/new' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <setdynvars sourcetype="random_string" length="20">
        <var name="rnd_name" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="10" end="500">
        <var name="rnd_starting_price" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="5000" end="50000">
        <var name="rnd_fixed_price" />
      </setdynvars>

      <request subst="true" >
        <dyn_variable name="item_id_2" re="[Ll]ocation: http://.*/bid_items/(.*)\r" />
        <http url="/bid_items" version="1.1" contents="authenticity_token=%%_authenticity_token%%&amp;bid_item[item_name]=%%_rnd_name%%&amp;bid_item[starting_price]=%%_rnd_starting_price%%&amp;bid_item[fixed_price]=%%_rnd_fixed_price%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <!-- check the posted items -->
      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request subst="true" >
        <http url='/bid_items/%%_item_id_1%%' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request subst="true" >
        <http url='/bid_items/%%_item_id_2%%' version='1.1' method='GET'></http>
      </request>

      <!-- go to profile and check one item -->
      <request>
        <dyn_variable name='all_profile_selling_item_url' xpath="/html/body/div/div/div/div[1]/table/tbody/tr[*]/td[1]/a/@href"/>
        <http url='/users/profile' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                code='fun({Pid,DynVars})->
                      {ok,Val}=ts_dynvars:lookup(all_profile_selling_item_url,DynVars),
                      random:seed(now()),
                      lists:nth(random:uniform(length(Val)), Val) end.' >
                <var name="rnd_profile_selling_item_url" />
      </setdynvars>

      <request subst="true">
        <http url='%%_rnd_profile_selling_item_url%%' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <!-- check another -->
      <request>
        <dyn_variable name='all_profile_selling_item_url' xpath="/html/body/div/div/div/div[1]/table/tbody/tr[*]/td[1]/a/@href"/>
        <http url='/users/profile' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                code='fun({Pid,DynVars})->
                      {ok,Val}=ts_dynvars:lookup(all_profile_selling_item_url,DynVars),
                      random:seed(now()),
                      lists:nth(random:uniform(length(Val)), Val) end.' >
                <var name="rnd_profile_selling_item_url" />
      </setdynvars>

      <request subst="true">
        <http url='%%_rnd_profile_selling_item_url%%' version='1.1' method='GET'></http>
      </request>

    </session>

    <!-- ############################################################ -->
    <!-- flow 6, new users -->
    <session name="flow_6" probability="1" type="ts_http">
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <!-- go to sign up page -->
      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/users/sign_up' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <setdynvars sourcetype="random_string" length="5">
        <var name="user_email" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true" >
        <!-- <dyn_variable name="new_user_id" re="[Ll]ocation: http://.*/users/(.*)\r" /> -->
        <http url='/users' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=%%_user_email%%@ucsb&amp;user[password]=123456&amp;user[password_confirmation]=123456" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <!-- go to one community -->
      <request>
        <http url='/users/communities' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="nth_community" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true" >
        <http url='/communities/%%_nth_community' version='1.1' method='GET'></http>
      </request>

    </session>

  </sessions>
</tsung>